org/config/neofetch.org
# -*- org-confirm-babel-evaluate: nil -*-
#+title: Neofetch configuration (WIP)
#+setupfile: headers
#+OPTIONS: auto-id:t
#+HTML_HEAD_EXTRA: <meta name="description" content="Phundrak's Neofetch config" />
#+HTML_HEAD_EXTRA: <meta property="og:title" content="Phundrak's Neofetch config" />
#+HTML_HEAD_EXTRA: <meta property="og:description" content="Description of the Neofetch config file of Phundrak" />
#+PROPERTY: header-args :noweb yes :exports code :tangle no :exports none
#+PROPERTY: header-args:sh :tangle ~/.config/neofetch/config.conf.bak :exports code :noweb yes
#+STARTUP: content
# #+INFOJS_OPT: view:plain home:https://phundrak.com/config toc:t
#+INFOJS_OPT: up:https://phundrak.com/config/neofetch

* Introduction
  :PROPERTIES:
  :CUSTOM_ID: Introduction-a7a859ac
  :END:
  [[https://github.com/dylanaraps/neofetch][Neofetch]] is a  CLI utility used to display system  information. It was written
  in Bash, and thus its configuration file is written as a Bash script too. This
  document was written with org-mode, and  my configuration file is tangled from
  the source blocks you will see below to =~/.config/neofetch/config.conf=.
  First, let’s insert the Emacs config header in order to specify the mode to
  open the file with.
  #+BEGIN_SRC sh
    # -*- mode: sh -*-
  #+END_SRC

* The ~print_info~ functions
  :PROPERTIES:
  :CUSTOM_ID: The_~print_info~_functions-afbafdc3
  :END:
  The ~print_info~ function is the function called by Neofetch in order to print
  the system information it could fetch.  In this function, we’ll choose what to
  display, and how. This function looks like this:
  #+BEGIN_SRC sh
    print_info() {
        # Print information here…
    }
  #+END_SRC

  Generally, what  we will display  will be  shown through the  ~info~ function,
  redefined  inside  Neofetch (this  is  not  ~info(1)~). This  ~info~  function
  accepts one or  two arguments. With one argument, such  as with ~info memory~,
  we can  get a result  that looks  like ~5136MiB / 15873MiB~, while  calling it
  with two arguments will treat the first one  as a prefix and the second one as
  the   interesting   information;   ~info "Memory" memory~   will   look   like
  ~Memory: 5136MiB / 15873MiB~. Here is what we want to display:
  #+NAME: info-elements-table
  | Prefix   | Information | What it does                 |
  |----------+-------------+------------------------------|
  |          | line_break  | Insert a blank line          |
  |          | title       | Username and hostname        |
  |          | line_break  | Insert a blank line          |
  |          | cols        | System theme                 |
  |          | line_break  | Insert a blank line          |
  | OS       | distro      | Distribution name            |
  | Kernel   | kernel      | Kernel version               |
  | Uptime   | uptime      | Machine uptime               |
  | Packages | packages    | Number of installed packages |
  | Shell    | shell       | User’s default shell         |
  | WM       | wm          | User’s Window Manager        |
  | Terminal | term        | Default terminal             |
  | CPU      | cpu         | CPU information              |
  | GPU      | gpu         | GPU information              |
  | Memory   | memory      | RAM information              |

  #+NAME: info-elements-gen
  #+BEGIN_SRC emacs-lisp :var table=info-elements-table :cache yes
    (mapconcat (lambda (x)
                 (format "info %s%s"
                         (if (not (string= (car x) ""))
                             (format "\"%s\" " (car x))
                           "")
                         (cadr x)))
               table
               "\n")
  #+END_SRC

  #+RESULTS[b674f32b66234a67929a0426ce187ce712d806f4]: info-elements-gen
  #+begin_example
  info line_break
  info title
  info line_break
  info cols
  info line_break
  info "OS" distro
  info "Kernel" kernel
  info "Uptime" uptime
  info "Packages" packages
  info "Shell" shell
  info "WM" wm
  info "Terminal" term
  info "CPU" cpu
  info "GPU" gpu
  info "Memory" memory
  #+end_example

  Hence, the function looks like so:
  #+BEGIN_SRC sh
    print_info() {
        <<info-elements-gen()>>
    }
  #+END_SRC

  Each of these modules can be tuned with the variables presented below.

* Information settings
  :PROPERTIES:
  :CUSTOM_ID: Information_settings-7d3a990e
  :END:
  Each  of  the following  variable  tunes  a function  that  can  be called  in
  ~print_info~ described  above. It is possible  to tune them by  modifying this
  document or the  configuration file itself, and they can  be overridden by the
  command line with flags passed to ~neofetch~. I will divide these variables in
  two main categories: hardware and software-related properties.

** Software
   :PROPERTIES:
   :CUSTOM_ID: Information_settings-Software-7b13b829
   :END:
*** OS
    :PROPERTIES:
    :CUSTOM_ID: Information_settings-Software-OS-7019c112
    :END:
