org/config/neofetch.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-04-21 mar. 15:02 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Neofetch configuration</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Lucien Cartier-Tilet">
<meta name="keywords" content="dotfiles linux emacs configuration phundrak drakpa">
<meta property="og:image" content="https://cdn.phundrak.com/img/rich_preview.png" />
<meta name="twitter:card" content="summary" />
<meta name="twitter:site" content="@phundrak" />
<meta name="twitter:creator" content="@phundrak" />
<link rel="stylesheet" href="https://langue.phundrak.com/css/main.css"/>
<link rel="stylesheet" href="https://langue.phundrak.com/css/htmlize.min.css"/>
<link rel="stylesheet" id="theme" href="https://langue.phundrak.com/css/dark.css"/>
<link rel="shortcut icon" href="https://cdn.phundrak.com/img/mahakala-128x128.png" type="img/png" media="screen" />
<link rel="shortcut icon" href="https://cdn.phundrak.com/img/favicon.ico" type="image/x-icon" media="screen" />
<meta name="description" content="Phundrak's Neofetch config" />
<meta property="og:title" content="Phundrak's Neofetch config" />
<meta property="og:description" content="Description of the Neofetch config file of Phundrak" />

</head>
<body>
<div id="content">
<h1 class="title">Neofetch configuration</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#h-1b7321bc-190e-41a7-a6e0-ff13e9a61b74">1. Introduction</a></li>
<li><a href="#h-3a3a5ade-adab-4508-9aa9-17896126b169">2. The <code>print_info</code> functions</a></li>
<li><a href="#h-d1ddb7fc-e87a-42d1-a71b-6fc7b10c9f78">3. Information settings</a>
<ul>
<li><a href="#h-2f562a5c-3530-4b50-b553-a0cb801affea">3.1. Software</a>
<ul>
<li><a href="#h-afe50abf-8988-48dd-9768-72eb0143b613">3.1.1. OS</a>
<ul>
<li><a href="#h-be4b75c8-2612-4e40-933f-bd451bd6fc5e">3.1.1.1. Kernel</a></li>
<li><a href="#h-979a15ac-c2ac-41a4-91f2-5676feba6dd4">3.1.1.2. Distro</a></li>
<li><a href="#h-c621c645-f926-411f-852c-9b4508a0736a">3.1.1.3. OS Architecture</a></li>
</ul>
</li>
<li><a href="#h-41f62c23-4306-4828-a824-7a33e19deee5">3.1.2. Uptime shorthand</a></li>
<li><a href="#h-759202dd-43a9-477f-8d11-df1790870673">3.1.3. Shell</a>
<ul>
<li><a href="#h-dd92a375-1fa1-4e46-9427-503c03b83b83">3.1.3.1. Shell path</a></li>
<li><a href="#h-636dfde0-f0d1-4166-870c-8f1ff31b6dc2">3.1.3.2. Shell version</a></li>
</ul>
</li>
<li><a href="#h-e2ee7a72-d852-436d-b610-946508597696">3.1.4. Theming</a>
<ul>
<li><a href="#h-19994d7e-908b-4e20-912c-a527eee19668">3.1.4.1. Shorten output</a></li>
<li><a href="#h-c9bf1b93-ec7b-4c48-b9f8-5d44edbcb8bc">3.1.4.2. Enable or disable theming display for GTK2</a></li>
<li><a href="#h-6d367bd6-bb5c-469c-bfd7-145ef0ecd6d9">3.1.4.3. Enable or disable theming display for GTK3</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#h-d7f87860-5c1d-427b-9d2e-f7674d9fbab5">3.2. Hardware</a>
<ul>
<li><a href="#h-b2183b8b-de13-4812-a7da-9f2d4d66e42d">3.2.1. CPU</a>
<ul>
<li><a href="#h-7300f2bb-e8d2-4ede-8765-a6e8883af99e">3.2.1.1. CPU brand</a></li>
<li><a href="#h-5cd70ef6-4ba3-45a3-a46e-ec2d5b76d36a">3.2.1.2. CPU speed</a></li>
<li><a href="#h-61affc64-b69d-44f2-b950-1623cd908b6a">3.2.1.3. CPU speed type</a></li>
<li><a href="#h-6138e3bd-937f-4604-b2c0-db0a49b869bc">3.2.1.4. CPU speed shorthand</a></li>
<li><a href="#h-eea09747-5334-49af-aef3-1a29f59ea40e">3.2.1.5. CPU cores</a></li>
<li><a href="#h-66633b86-2427-4079-9e62-e72b3d458a21">3.2.1.6. CPU temperature</a></li>
</ul>
</li>
<li><a href="#h-6138e3bd-937f-4604-b2c0-db0a49b869bc">3.2.2. GPU</a>
<ul>
<li><a href="#h-d2a0a4dd-7dc4-4584-8093-ce417b4bb59b">3.2.2.1. GPU brand</a></li>
<li><a href="#h-4309d902-fc80-48c9-be89-02b932d1f650">3.2.2.2. Which GPU to display</a></li>
</ul>
</li>
<li><a href="#h-9803fa70-bf09-400a-800f-071de9f2d91d">3.2.3. Resolution</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-h-1b7321bc-190e-41a7-a6e0-ff13e9a61b74" class="outline-2">
<h2 id="h-1b7321bc-190e-41a7-a6e0-ff13e9a61b74"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-h-1b7321bc-190e-41a7-a6e0-ff13e9a61b74">
<p>
<a href="https://github.com/dylanaraps/neofetch">Neofetch</a> is a  CLI utility used to display system  information. It was written
in Bash, and thus its configuration file is written as a Bash script too. This
document was written with org-mode, and  my configuration file is tangled from
the source blocks you will see below to <code>~/.config/neofetch/config.conf</code>.
First, let’s insert the Emacs config header in order to specify the mode to
open the file with.
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #62686E;"># </span><span style="color: #62686E;">-*- mode: sh -*-</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-h-3a3a5ade-adab-4508-9aa9-17896126b169" class="outline-2">
<h2 id="h-3a3a5ade-adab-4508-9aa9-17896126b169"><span class="section-number-2">2</span> The <code>print_info</code> functions</h2>
<div class="outline-text-2" id="text-h-3a3a5ade-adab-4508-9aa9-17896126b169">
<p>
The <code>print_info</code> function is the function called by Neofetch in order to print
the system information it could fetch.  In this function, we’ll choose what to
display, and how. This function looks like this:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #5cEfFF;">print_info</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #62686E;"># </span><span style="color: #62686E;">Print information here&#8230;</span>
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
Generally, what  we will display  will be  shown through the  <code>info</code> function,
redefined  inside  Neofetch (this  is  not  <code>info(1)</code>). This  <code>info</code>  function
accepts one or  two arguments. With one argument, such  as with <code>info memory</code>,
we can  get a result  that looks  like <code>5136MiB / 15873MiB</code>, while  calling it
with two arguments will treat the first one  as a prefix and the second one as
the   interesting   information;   <code>info "Memory" memory</code>   will   look   like
<code>Memory: 5136MiB / 15873MiB</code>. Here is what we want to display:
</p>
<table id="org41fba92">


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Prefix</th>
<th scope="col" class="org-left">Information</th>
<th scope="col" class="org-left">What it does</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">line_break</td>
<td class="org-left">Insert a blank line</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">title</td>
<td class="org-left">Username and hostname</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">line_break</td>
<td class="org-left">Insert a blank line</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">cols</td>
<td class="org-left">System theme</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">line_break</td>
<td class="org-left">Insert a blank line</td>
</tr>

<tr>
<td class="org-left">OS</td>
<td class="org-left">distro</td>
<td class="org-left">Distribution name</td>
</tr>

<tr>
<td class="org-left">Kernel</td>
<td class="org-left">kernel</td>
<td class="org-left">Kernel version</td>
</tr>

<tr>
<td class="org-left">Uptime</td>
<td class="org-left">uptime</td>
<td class="org-left">Machine uptime</td>
</tr>

<tr>
<td class="org-left">Packages</td>
<td class="org-left">packages</td>
<td class="org-left">Number of installed packages</td>
</tr>

<tr>
<td class="org-left">Shell</td>
<td class="org-left">shell</td>
<td class="org-left">User’s default shell</td>
</tr>

<tr>
<td class="org-left">WM</td>
<td class="org-left">wm</td>
<td class="org-left">User’s Window Manager</td>
</tr>

<tr>
<td class="org-left">Terminal</td>
<td class="org-left">term</td>
<td class="org-left">Default terminal</td>
</tr>

<tr>
<td class="org-left">CPU</td>
<td class="org-left">cpu</td>
<td class="org-left">CPU information</td>
</tr>

<tr>
<td class="org-left">GPU</td>
<td class="org-left">gpu</td>
<td class="org-left">GPU information</td>
</tr>

<tr>
<td class="org-left">Memory</td>
<td class="org-left">memory</td>
<td class="org-left">RAM information</td>
</tr>
</tbody>
</table>

<p>
Hence, the function looks like so:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #5cEfFF;">print_info</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    info line_break
    info title
    info line_break
    info cols
    info line_break
    info <span style="color: #7bc275;">"OS"</span> distro
    info <span style="color: #7bc275;">"Kernel"</span> kernel
    info <span style="color: #7bc275;">"Uptime"</span> uptime
    info <span style="color: #7bc275;">"Packages"</span> packages
    info <span style="color: #7bc275;">"Shell"</span> shell
    info <span style="color: #7bc275;">"WM"</span> wm
    info <span style="color: #7bc275;">"Terminal"</span> term
    info <span style="color: #7bc275;">"CPU"</span> cpu
    info <span style="color: #7bc275;">"GPU"</span> gpu
    info <span style="color: #7bc275;">"Memory"</span> memory

<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
Each of these modules can be tuned with the variables presented below.
</p>
</div>
</div>

<div id="outline-container-h-d1ddb7fc-e87a-42d1-a71b-6fc7b10c9f78" class="outline-2">
<h2 id="h-d1ddb7fc-e87a-42d1-a71b-6fc7b10c9f78"><span class="section-number-2">3</span> Information settings</h2>
<div class="outline-text-2" id="text-h-d1ddb7fc-e87a-42d1-a71b-6fc7b10c9f78">
<p>
Each  of  the following  variable  tunes  a function  that  can  be called  in
<code>print_info</code> described  above. It is possible  to tune them by  modifying this
document or the  configuration file itself, and they can  be overridden by the
command line with flags passed to <code>neofetch</code>. I will divide these variables in
two main categories: hardware and software-related properties.
</p>
</div>
