org/config/neofetch.org
**** Kernel
     :PROPERTIES:
     :CUSTOM_ID: Information_settings-Software-OS-Kernel-df1062f0
     :END:
     The variable below can shorten the output ofh the ~kernel~ function.
     - Default value :: ~"on"~
     - Values ::
       - ~"on"~
       - ~"off"~
     - Flag :: ~"--kernel_shorthand"~
     - Supports :: Everything except *BSDs (except PacBSD and PC-BSD)
     - Examples ::
       - on :: ~4.8.9-1-ARCH~
       - off :: ~Linux 4.8.9-1-ARCH~
     #+begin_src sh
       kernel_shorthand="off"
     #+end_src

**** Distro
     :PROPERTIES:
     :CUSTOM_ID: Information_settings-Software-OS-Distro-3c8118d9
     :END:
     This variable can shorten the output of the ~distro~ function.
     - Default value :: ~"on"~
     - Values ::
       - ~"on"~
       - ~"off"~
     - Flag :: ~"--distro_shorthand"~
     - Supports :: Everything except Windows and Haiku
     - Examples ::
       - on :: ~Arch Linux~
       - off :: ~Arch~
     #+begin_src sh
       distro_shorthand="off"
     #+end_src

**** OS Architecture
     :PROPERTIES:
     :CUSTOM_ID: Information_settings-Software-OS-OS_Architecture-1164eea9
     :END:
     This variable can show or hide the OS architecture in the ~distro~ output.
     - Default value :: ~"off"~
     - Values ::
       - ~"on"~
       - ~"off"~
     - Flag :: ~"--os_arch"~
     - Examples ::
       - on :: ~Arch Linux x86_64~
       - off :: ~Arch Linux~
     #+begin_src sh
       os_arch="off"
     #+end_src

*** Uptime shorthand
    :PROPERTIES:
    :CUSTOM_ID: Information_settings-Software-Uptime_shorthand-70ff185a
    :END:
    This variable can shorten the output of the ~uptime~ function. ~on~ shortens
    it a bit, while ~tiny~ shortens it greatly.
    - Default value :: ~"on"~
    - Values ::
      - ~"on"~
      - ~"tiny"~
      - ~"off"~
    - Flag :: ~"--uptime_shorthand"~
    - Examples ::
      - on :: ~2 days, 10 hours, 3 mins~
      - off :: ~2 days, 10 hours, 3 minutes~
      - tiny :: ~2d 10h 3m~
    #+begin_src sh
      uptime_shorthand="on"
    #+end_src

*** Shell
    :PROPERTIES:
    :CUSTOM_ID: Information_settings-Software-Shell-b958db2a
    :END:
**** Shell path
     :PROPERTIES:
     :CUSTOM_ID: Information_settings-Software-Shell-Shell_path-fff91e35
     :END:
     This allows  to show  either the path  of the user’s  shell, or  simply its
     name.
     - Default value :: ~"off"~
     - Values ::
      - ~"on"~
      - ~"off"~
     - Flag :: ~"--shell_path"~
     - Examples ::
       - on :: ~/bin/bash~
       - off :: ~bash~
    #+begin_src sh
      shell_path="off"
    #+end_src

**** Shell version
     :PROPERTIES:
     :CUSTOM_ID: Information_settings-Software-Shell-Shell_version-a1702748
     :END:
     This allows to show the shell’s version in the output of ~shell~.
    - Default value :: ~"on"~
    - Values ::
      - ~"on"~
      - ~"off"~
    - Flag :: ~"--shell_version"~
    - Examples ::
      - on :: ~bash 4.4.5~
      - off :: ~bash~
    #+begin_src sh
      shell_version="off"
    #+end_src

*** Theming
    :PROPERTIES:
    :CUSTOM_ID: Information_settings-Software-Theming-44dc624d
    :END:
    This section  will allow  the user  to modify what  Neofetch can  and cannot
    display about  the machine’s  theming —by  this, I mean  its GTK  theme, its
    icons and its default font.

**** Shorten output
     :PROPERTIES:
     :CUSTOM_ID: Information_settings-Software-Theming-Shorten_output-bdb4af3f
     :END:
     With this  value, it is  possible to shorten  the output of  the computer’s
     theming.
     - Default value :: ~"off"~
     - Values ::
       - ~"on"~
       - ~"off"~
     - Flag :: ~"--gtk_shorthand"~
     - Examples ::
       - on :: ~Numix, Adwaita~
       - off :: ~Numix [GTK2], Adwaita [GTK3]~
     #+begin_src sh
       gtk_shorthand="on"
     #+end_src

**** Enable or disable theming display for GTK2
     :PROPERTIES:
     :CUSTOM_ID: Information_settings-Software-Theming-Enable_or_disable_theming_display_for_GTK2-6bfd9cf8
     :END:
     It is possible to explicitely show or hide the computer’s theming with GTK2
     with this variable.
     - Default value :: ~"on"~
     - Values ::
       - ~"on"~
       - ~"off"~
     - Flag :: ~"--gtk2"~
     - Examples ::
       - on ::  ~Numix [GTK2], Adwaita [GTK3]~
       - off :: ~Adwaita [GTK3]~
     #+begin_src sh
       gtk2="off"
     #+end_src

**** Enable or disable theming display for GTK3
     :PROPERTIES:
     :CUSTOM_ID: Information_settings-Software-Theming-Enable_or_disable_theming_display_for_GTK3-7dde3690
     :END:
     The same variable as above is also available for GTK3.
     - Default value :: ~"on"~
     - Values ::
       - ~"on"~
       - ~"off"~
     - Flag :: ~"--gtk3"~
     - Examples ::
       - on ::  ~Numix [GTK2], Adwaita [GTK3]~
       - off :: ~Numix [GTK2]~
     #+begin_src sh
     #+end_src

*** IP address
    :PROPERTIES:
    :CUSTOM_ID: Information_settings-Software-IP_address-66efe064
    :END:
    It is possible to display the  machine’s public IP address with the function
    ~ip~. The value  below allows the user  to change the website  used to fetch
    it.
    - Default value :: ~"http://ident.me"~
    - Value :: ~"url"~
    - Flag :: ~"--ip_host"~
    #+begin_src sh
      public_ip_host="http://ident.me"
    #+end_src

    - Default value :: ~""~
    - Values ::
      - ~""~
      - ~""~
    - Flag :: ~""~
    - Supports ::
    - Examples ::
      - on :: ~~
      - off :: ~~
    #+begin_src sh
    #+end_src

** Hardware
   :PROPERTIES:
   :CUSTOM_ID: Information_settings-Hardware-490075ce
   :END:
*** CPU
    :PROPERTIES:
    :CUSTOM_ID: Information_settings-Hardware-CPU-dfa36b11
    :END:

