org/config/neofetch.html

<div id="outline-container-h-2f562a5c-3530-4b50-b553-a0cb801affea" class="outline-3">
<h3 id="h-2f562a5c-3530-4b50-b553-a0cb801affea"><span class="section-number-3">3.1</span> Software</h3>
<div class="outline-text-3" id="text-h-2f562a5c-3530-4b50-b553-a0cb801affea">
</div>
<div id="outline-container-h-afe50abf-8988-48dd-9768-72eb0143b613" class="outline-4">
<h4 id="h-afe50abf-8988-48dd-9768-72eb0143b613"><span class="section-number-4">3.1.1</span> OS</h4>
<div class="outline-text-4" id="text-h-afe50abf-8988-48dd-9768-72eb0143b613">
</div>
<div id="outline-container-h-be4b75c8-2612-4e40-933f-bd451bd6fc5e" class="outline-5">
<h5 id="h-be4b75c8-2612-4e40-933f-bd451bd6fc5e"><span class="section-number-5">3.1.1.1</span> Kernel</h5>
<div class="outline-text-5" id="text-h-be4b75c8-2612-4e40-933f-bd451bd6fc5e">
<p>
The variable below can shorten the output ofh the <code>kernel</code> function.
</p>
<dl class="org-dl">
<dt>Default value</dt><dd><code>"on"</code></dd>
<dt>Values</dt><dd><ul class="org-ul">
<li><code>"on"</code></li>
<li><code>"off"</code></li>
</ul></dd>
<dt>Flag</dt><dd><code>"--kernel_shorthand"</code></dd>
<dt>Supports</dt><dd>Everything except *BSDs (except PacBSD and PC-BSD)</dd>
<dt>Examples</dt><dd><dl class="org-dl">
<dt>on</dt><dd><code>4.8.9-1-ARCH</code></dd>
<dt>off</dt><dd><code>Linux 4.8.9-1-ARCH</code></dd>
</dl></dd>
</dl>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #DFDFDF;">kernel_shorthand</span>=<span style="color: #7bc275;">"off"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-h-979a15ac-c2ac-41a4-91f2-5676feba6dd4" class="outline-5">
<h5 id="h-979a15ac-c2ac-41a4-91f2-5676feba6dd4"><span class="section-number-5">3.1.1.2</span> Distro</h5>
<div class="outline-text-5" id="text-h-979a15ac-c2ac-41a4-91f2-5676feba6dd4">
<p>
This variable can shorten the output of the <code>distro</code> function.
</p>
<dl class="org-dl">
<dt>Default value</dt><dd><code>"on"</code></dd>
<dt>Values</dt><dd><ul class="org-ul">
<li><code>"on"</code></li>
<li><code>"off"</code></li>
</ul></dd>
<dt>Flag</dt><dd><code>"--distro_shorthand"</code></dd>
<dt>Supports</dt><dd>Everything except Windows and Haiku</dd>
<dt>Examples</dt><dd><dl class="org-dl">
<dt>on</dt><dd><code>Arch Linux</code></dd>
<dt>off</dt><dd><code>Arch</code></dd>
</dl></dd>
</dl>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #DFDFDF;">distro_shorthand</span>=<span style="color: #7bc275;">"off"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-h-c621c645-f926-411f-852c-9b4508a0736a" class="outline-5">
<h5 id="h-c621c645-f926-411f-852c-9b4508a0736a"><span class="section-number-5">3.1.1.3</span> OS Architecture</h5>
<div class="outline-text-5" id="text-h-c621c645-f926-411f-852c-9b4508a0736a">
<p>
This variable can show or hide the OS architecture in the <code>distro</code> output.
</p>
<dl class="org-dl">
<dt>Default value</dt><dd><code>"off"</code></dd>
<dt>Values</dt><dd><ul class="org-ul">
<li><code>"on"</code></li>
<li><code>"off"</code></li>
</ul></dd>
<dt>Flag</dt><dd><code>"--os_arch"</code></dd>
<dt>Examples</dt><dd><dl class="org-dl">
<dt>on</dt><dd><code>Arch Linux x86_64</code></dd>
<dt>off</dt><dd><code>Arch Linux</code></dd>
</dl></dd>
</dl>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #DFDFDF;">os_arch</span>=<span style="color: #7bc275;">"off"</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-h-41f62c23-4306-4828-a824-7a33e19deee5" class="outline-4">
<h4 id="h-41f62c23-4306-4828-a824-7a33e19deee5"><span class="section-number-4">3.1.2</span> Uptime shorthand</h4>
<div class="outline-text-4" id="text-h-41f62c23-4306-4828-a824-7a33e19deee5">
<p>
This variable can shorten the output of the <code>uptime</code> function. <code>on</code> shortens
it a bit, while <code>tiny</code> shortens it greatly.
</p>
<dl class="org-dl">
<dt>Default value</dt><dd><code>"on"</code></dd>
<dt>Values</dt><dd><ul class="org-ul">
<li><code>"on"</code></li>
<li><code>"tiny"</code></li>
<li><code>"off"</code></li>
</ul></dd>
<dt>Flag</dt><dd><code>"--uptime_shorthand"</code></dd>
<dt>Examples</dt><dd><dl class="org-dl">
<dt>on</dt><dd><code>2 days, 10 hours, 3 mins</code></dd>
<dt>off</dt><dd><code>2 days, 10 hours, 3 minutes</code></dd>
<dt>tiny</dt><dd><code>2d 10h 3m</code></dd>
</dl></dd>
</dl>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #DFDFDF;">uptime_shorthand</span>=<span style="color: #7bc275;">"on"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-h-759202dd-43a9-477f-8d11-df1790870673" class="outline-4">
<h4 id="h-759202dd-43a9-477f-8d11-df1790870673"><span class="section-number-4">3.1.3</span> Shell</h4>
<div class="outline-text-4" id="text-h-759202dd-43a9-477f-8d11-df1790870673">
</div>
<div id="outline-container-h-dd92a375-1fa1-4e46-9427-503c03b83b83" class="outline-5">
<h5 id="h-dd92a375-1fa1-4e46-9427-503c03b83b83"><span class="section-number-5">3.1.3.1</span> Shell path</h5>
<div class="outline-text-5" id="text-h-dd92a375-1fa1-4e46-9427-503c03b83b83">
<p>
This allows  to show  either the path  of the user’s  shell, or  simply its
name.
</p>
<dl class="org-dl">
<dt>Default value</dt><dd><code>"off"</code></dd>
<dt>Values</dt><dd><ul class="org-ul">
<li><code>"on"</code></li>
<li><code>"off"</code></li>
</ul></dd>
<dt>Flag</dt><dd><code>"--shell_path"</code></dd>
<dt>Examples</dt><dd><dl class="org-dl">
<dt>on</dt><dd><code>/bin/bash</code></dd>
<dt>off</dt><dd><code>bash</code></dd>
</dl></dd>
</dl>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #DFDFDF;">shell_path</span>=<span style="color: #7bc275;">"off"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-h-636dfde0-f0d1-4166-870c-8f1ff31b6dc2" class="outline-5">
<h5 id="h-636dfde0-f0d1-4166-870c-8f1ff31b6dc2"><span class="section-number-5">3.1.3.2</span> Shell version</h5>
<div class="outline-text-5" id="text-h-636dfde0-f0d1-4166-870c-8f1ff31b6dc2">
<p>
This allows to show the shell’s version in the output of <code>shell</code>.
</p>
<dl class="org-dl">
<dt>Default value</dt><dd><code>"on"</code></dd>
<dt>Values</dt><dd><ul class="org-ul">
<li><code>"on"</code></li>
<li><code>"off"</code></li>
</ul></dd>
<dt>Flag</dt><dd><code>"--shell_version"</code></dd>
<dt>Examples</dt><dd><dl class="org-dl">
<dt>on</dt><dd><code>bash 4.4.5</code></dd>
<dt>off</dt><dd><code>bash</code></dd>
</dl></dd>
</dl>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #DFDFDF;">shell_version</span>=<span style="color: #7bc275;">"off"</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-h-e2ee7a72-d852-436d-b610-946508597696" class="outline-4">
<h4 id="h-e2ee7a72-d852-436d-b610-946508597696"><span class="section-number-4">3.1.4</span> Theming</h4>
<div class="outline-text-4" id="text-h-e2ee7a72-d852-436d-b610-946508597696">
<p>
This section  will allow  the user  to modify what  Neofetch can  and cannot
display about  the machine’s  theming —by  this, I mean  its GTK  theme, its
icons and its default font.
</p>
</div>

<div id="outline-container-h-19994d7e-908b-4e20-912c-a527eee19668" class="outline-5">
<h5 id="h-19994d7e-908b-4e20-912c-a527eee19668"><span class="section-number-5">3.1.4.1</span> Shorten output</h5>
<div class="outline-text-5" id="text-h-19994d7e-908b-4e20-912c-a527eee19668">
<p>
With this  value, it is  possible to shorten  the output of  the computer’s
theming.
</p>
<dl class="org-dl">
<dt>Default value</dt><dd><code>"off"</code></dd>
<dt>Values</dt><dd><ul class="org-ul">
<li><code>"on"</code></li>
<li><code>"off"</code></li>
</ul></dd>
<dt>Flag</dt><dd><code>"--gtk_shorthand"</code></dd>
<dt>Examples</dt><dd><dl class="org-dl">
<dt>on</dt><dd><code>Numix, Adwaita</code></dd>
<dt>off</dt><dd><code>Numix [GTK2], Adwaita [GTK3]</code></dd>
</dl></dd>
</dl>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #DFDFDF;">gtk_shorthand</span>=<span style="color: #7bc275;">"on"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-h-c9bf1b93-ec7b-4c48-b9f8-5d44edbcb8bc" class="outline-5">
<h5 id="h-c9bf1b93-ec7b-4c48-b9f8-5d44edbcb8bc"><span class="section-number-5">3.1.4.2</span> Enable or disable theming display for GTK2</h5>
<div class="outline-text-5" id="text-h-c9bf1b93-ec7b-4c48-b9f8-5d44edbcb8bc">
<p>
It is possible to explicitely show or hide the computer’s theming with GTK2
with this variable.
</p>
<dl class="org-dl">
<dt>Default value</dt><dd><code>"on"</code></dd>
<dt>Values</dt><dd><ul class="org-ul">
<li><code>"on"</code></li>
<li><code>"off"</code></li>
</ul></dd>
<dt>Flag</dt><dd><code>"--gtk2"</code></dd>
<dt>Examples</dt><dd><dl class="org-dl">
<dt>on</dt><dd><code>Numix [GTK2], Adwaita [GTK3]</code></dd>
<dt>off</dt><dd><code>Adwaita [GTK3]</code></dd>
</dl></dd>
</dl>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #DFDFDF;">gtk2</span>=<span style="color: #7bc275;">"off"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-h-6d367bd6-bb5c-469c-bfd7-145ef0ecd6d9" class="outline-5">
<h5 id="h-6d367bd6-bb5c-469c-bfd7-145ef0ecd6d9"><span class="section-number-5">3.1.4.3</span> Enable or disable theming display for GTK3</h5>
<div class="outline-text-5" id="text-h-6d367bd6-bb5c-469c-bfd7-145ef0ecd6d9">
<p>
The same variable as above is also available for GTK3.
</p>
<dl class="org-dl">
<dt>Default value</dt><dd><code>"on"</code></dd>
<dt>Values</dt><dd><ul class="org-ul">
<li><code>""</code></li>
<li><code>""</code></li>
</ul></dd>
<dt>Flag</dt><dd><code>""</code></dd>
<dt>Supports</dt><dd></dd>

<dt>Examples</dt><dd><dl class="org-dl">
<dt>on</dt><dd>~~</dd>
<dt>off</dt><dd>~~</dd>
</dl></dd>
</dl>
<div class="org-src-container">
<pre class="src src-sh">
</pre>
</div>


<dl class="org-dl">
<dt>Default value</dt><dd><code>""</code></dd>
<dt>Values</dt><dd><ul class="org-ul">
<li><code>""</code></li>
<li><code>""</code></li>
</ul></dd>
<dt>Flag</dt><dd><code>""</code></dd>
<dt>Supports</dt><dd></dd>

<dt>Examples</dt><dd><dl class="org-dl">
<dt>on</dt><dd>~~</dd>
<dt>off</dt><dd>~~</dd>
</dl></dd>
</dl>
<div class="org-src-container">
<pre class="src src-sh">
</pre>
</div>
</div>
</div>
</div>
</div>
