org/config/neofetch.org
**** CPU brand
     :PROPERTIES:
     :CUSTOM_ID: Information_settings-Hardware-CPU-CPU_brand-12ceb9ce
     :END:
     With this variables, it  is possible to show or hide the brand  of a CPU in
     the ~cpu~ output.
     - Default value :: ~"on"~
     - Values ::
       - ~"on"~
       - ~"off"~
     - Flag :: ~"--cpu_brand"~
     - Examples ::
       - on :: ~Intel i7-6500U~
       - off :: ~i7-6500U~
     #+begin_src sh
       cpu_brand="off"
     #+end_src

**** CPU speed
     :PROPERTIES:
     :CUSTOM_ID: Information_settings-Hardware-CPU-CPU_speed-86e4ea04
     :END:
     With this variable, it is possible to show or hide the speed of the CPU.
     - Default value :: ~"on"~
     - Values ::
       - ~"on"~
       - ~"off"~
     - Flag :: ~"--cpu_speed"~
     - Examples ::
       - on :: ~Intel i7-6500U (4) @ 3.1GHz~
       - off :: ~Intel i7-6500U (4)~
     #+begin_src sh
       cpu_speed="off"
     #+end_src

**** CPU speed type
     :PROPERTIES:
     :CUSTOM_ID: Information_settings-Hardware-CPU-CPU_speed_type-4380a471
     :END:
     This allows Neofetch to  know what type of speed it  has to fetch regarding
     the machine’s  CPU. Any file in  ~/sys/devices/system/cpu/cpu0/cpufreq~ can
     be used as a value.
    - Default value :: ~"bios_limit"~
    - Values ::
      - ~"scaling_cur_freq"~
      - ~"scaling_min_freq"~
      - ~"scaling_max_freq"~
      - ~"bios_limit"~
    - Flag :: ~"--speed_type"~
    - Supports :: Linux with ~cpufreq~
    #+begin_src sh
      speed_type="bios_limit"
    #+end_src

**** CPU speed shorthand
     :PROPERTIES:
     :CUSTOM_ID: Information_settings-Hardware-CPU-CPU_speed_shorthand-8000dc1f
     :END:
     This value allows  to show sorter CPU  speed with less digits.  This flag is
     not supported in systems with CPU speed below 1GHz.
     - Default value :: ~"off"~
     - Values ::
       - ~"on"~
       - ~"on"~
     - Flag :: ~"--speed_shorthand"~
     - Examples ::
       - on :: ~i7-6500U (4) @ 3.1GHz~
       - off :: ~i7-6500U (4) @ 3.100GHz~
     #+begin_src sh
       speed_shorthand="on"
     #+end_src

**** CPU cores
     :PROPERTIES:
     :CUSTOM_ID: Information_settings-Hardware-CPU-CPU_cores-66e72a57
     :END:
     With this variable, it is possible to  display the number of cores that are
     available in the CPU.
     - Default value :: ~"logical"~
     - Values ::
       - ~"logical"~
       - ~"physical"~
       - ~"off"~
     - Flag :: ~"--cpu_cores"~
     - Supports :: ~physical~ does not work on BSD.
     - Examples ::
       - logical :: ~Intel i7-6500U (4) @ 3.1GHz~ (All virtual cores)
       - physical :: ~Intel i7-6500U (2) @ 3.1GHz~ (All physical cores)
       - off :: ~Intel i7-6500U @ 3.1GHz~
     #+begin_src sh
       cpu_cores="off"
     #+end_src

**** CPU temperature
     :PROPERTIES:
     :CUSTOM_ID: Information_settings-Hardware-CPU-CPU_temperature-c79fb1a1
     :END:
     This variable allows the user to hide or show the CPU’s temperature, and if
     shown, the user can display it in Celcius or Farenheit degrees. For FreeBSD
     and  NetBSD-based systems,  you’ll  need to  enable  the ~coretemp~  kernel
     module. This only supports newer Intel processors.
     - Default value :: ~"off"~
     - Values ::
       - ~"C"~
       - ~"F"~
       - ~"off"~
     - Flag :: ~"--cpu_temp"~
     - Supports :: Linux, BSD
     - Examples ::
       - C :: ~Intel i7-6500U (4) @ 3.1GHz [27.2°C]~
       - F :: ~Intel i7-6500U (4) @ 3.1GHz [82.0°F]~
       - off :: ~Intel i7-6500U (4) @ 3.1GHz~
     #+begin_src sh
       cpu_temp="off"
     #+end_src

*** GPU
    :PROPERTIES:
    :CUSTOM_ID: Information_settings-Hardware-GPU-f9450397
    :END:
    The function  responsible for displaying  information regarding the  GPUs is
    ~gpu~. It  will try  to list all  available GPUs and  display what  it knows
    about them.

**** GPU brand
     :PROPERTIES:
     :CUSTOM_ID: Information_settings-Hardware-GPU-GPU_brand-c8d3c67d
     :END:
     This value allows  the user to hide or  show the brand of their  GPU in the
     output of ~gpu~.
     - Default value :: ~"on"~
     - Values ::
       - ~"on"~
       - ~"off"~
     - Flag :: ~"--gpu_brand"~
     - Supports ::
     - Examples ::
       - on :: ~AMD HD 7950~
       - off :: ~HD 7950~
     #+begin_src sh
       gpu_brand="off"
     #+end_src

**** Which GPU to display
     :PROPERTIES:
     :CUSTOM_ID: Information_settings-Hardware-GPU-Which_GPU_to_display-a6f72453
     :END:
     This allows  the user  to choose  which GPU  appears in  the output  of the
     function ~gpu~.
     - Default value :: ~"all"~
     - Values ::
       - ~"all"~
       - ~"dedicated"~
       - ~"integrated"~
     - Flag :: ~"--gpu_type"~
     - Supports :: Linux
     - Examples ::
       - all ::
         #+BEGIN_SRC text
           GPU1: AMD HD 7950
           GPU2: Intel Integrated Graphics
        #+END_SRC
       - dedicated :: ~GPU1: AMD HD 7950~
       - integrated :: ~GPU1: Intel Integrated Graphics~
     #+begin_src sh
       gpu_type="all"
     #+end_src

