org/config/neofetch.html

<div id="outline-container-h-d7f87860-5c1d-427b-9d2e-f7674d9fbab5" class="outline-3">
<h3 id="h-d7f87860-5c1d-427b-9d2e-f7674d9fbab5"><span class="section-number-3">3.2</span> Hardware</h3>
<div class="outline-text-3" id="text-h-d7f87860-5c1d-427b-9d2e-f7674d9fbab5">
</div>
<div id="outline-container-h-b2183b8b-de13-4812-a7da-9f2d4d66e42d" class="outline-4">
<h4 id="h-b2183b8b-de13-4812-a7da-9f2d4d66e42d"><span class="section-number-4">3.2.1</span> CPU</h4>
<div class="outline-text-4" id="text-h-b2183b8b-de13-4812-a7da-9f2d4d66e42d">
</div>

<div id="outline-container-h-7300f2bb-e8d2-4ede-8765-a6e8883af99e" class="outline-5">
<h5 id="h-7300f2bb-e8d2-4ede-8765-a6e8883af99e"><span class="section-number-5">3.2.1.1</span> CPU brand</h5>
<div class="outline-text-5" id="text-h-7300f2bb-e8d2-4ede-8765-a6e8883af99e">
<p>
With this variables, it  is possible to show or hide the brand  of a CPU in
the <code>cpu</code> output.
</p>
<dl class="org-dl">
<dt>Default value</dt><dd><code>"on"</code></dd>
<dt>Values</dt><dd><ul class="org-ul">
<li><code>"on"</code></li>
<li><code>"off"</code></li>
</ul></dd>
<dt>Flag</dt><dd><code>"--cpu_brand"</code></dd>
<dt>Examples</dt><dd><dl class="org-dl">
<dt>on</dt><dd><code>Intel i7-6500U</code></dd>
<dt>off</dt><dd><code>i7-6500U</code></dd>
</dl></dd>
</dl>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #DFDFDF;">cpu_brand</span>=<span style="color: #7bc275;">"off"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-h-5cd70ef6-4ba3-45a3-a46e-ec2d5b76d36a" class="outline-5">
<h5 id="h-5cd70ef6-4ba3-45a3-a46e-ec2d5b76d36a"><span class="section-number-5">3.2.1.2</span> CPU speed</h5>
<div class="outline-text-5" id="text-h-5cd70ef6-4ba3-45a3-a46e-ec2d5b76d36a">
<p>
With this variable, it is possible to show or hide the speed of the CPU.
</p>
<dl class="org-dl">
<dt>Default value</dt><dd><code>"on"</code></dd>
<dt>Values</dt><dd><ul class="org-ul">
<li><code>"on"</code></li>
<li><code>"off"</code></li>
</ul></dd>
<dt>Flag</dt><dd><code>"--cpu_speed"</code></dd>
<dt>Examples</dt><dd><dl class="org-dl">
<dt>on</dt><dd><code>Intel i7-6500U (4) @ 3.1GHz</code></dd>
<dt>off</dt><dd><code>Intel i7-6500U (4)</code></dd>
</dl></dd>
</dl>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #DFDFDF;">cpu_speed</span>=<span style="color: #7bc275;">"off"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-h-61affc64-b69d-44f2-b950-1623cd908b6a" class="outline-5">
<h5 id="h-61affc64-b69d-44f2-b950-1623cd908b6a"><span class="section-number-5">3.2.1.3</span> CPU speed type</h5>
<div class="outline-text-5" id="text-h-61affc64-b69d-44f2-b950-1623cd908b6a">
<p>
This allows Neofetch to  know what type of speed it  has to fetch regarding
the machine’s  CPU. Any file in  <code>/sys/devices/system/cpu/cpu0/cpufreq</code> can
be used as a value.
</p>
<dl class="org-dl">
<dt>Default value</dt><dd><code>"bios_limit"</code></dd>
<dt>Values</dt><dd><ul class="org-ul">
<li><code>"scaling_cur_freq"</code></li>
<li><code>"scaling_min_freq"</code></li>
<li><code>"scaling_max_freq"</code></li>
<li><code>"bios_limit"</code></li>
</ul></dd>
<dt>Flag</dt><dd><code>"--speed_type"</code></dd>
<dt>Supports</dt><dd>Linux with <code>cpufreq</code></dd>
</dl>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #DFDFDF;">speed_type</span>=<span style="color: #7bc275;">"bios_limit"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-h-6138e3bd-937f-4604-b2c0-db0a49b869bc" class="outline-5">
<h5 id="h-6138e3bd-937f-4604-b2c0-db0a49b869bc"><span class="section-number-5">3.2.1.4</span> CPU speed shorthand</h5>
<div class="outline-text-5" id="text-h-6138e3bd-937f-4604-b2c0-db0a49b869bc">
<p>
This value allows  to show sorter CPU  speed with less digits.  This flag is
not supported in systems with CPU speed below 1GHz.
</p>
<dl class="org-dl">
<dt>Default value</dt><dd><code>"off"</code></dd>
<dt>Values</dt><dd><ul class="org-ul">
<li><code>"on"</code></li>
<li><code>"on"</code></li>
</ul></dd>
<dt>Flag</dt><dd><code>"--speed_shorthand"</code></dd>
<dt>Examples</dt><dd><dl class="org-dl">
<dt>on</dt><dd><code>i7-6500U (4) @ 3.1GHz</code></dd>
<dt>off</dt><dd><code>i7-6500U (4) @ 3.100GHz</code></dd>
</dl></dd>
</dl>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #DFDFDF;">speed_shorthand</span>=<span style="color: #7bc275;">"on"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-h-eea09747-5334-49af-aef3-1a29f59ea40e" class="outline-5">
<h5 id="h-eea09747-5334-49af-aef3-1a29f59ea40e"><span class="section-number-5">3.2.1.5</span> CPU cores</h5>
<div class="outline-text-5" id="text-h-eea09747-5334-49af-aef3-1a29f59ea40e">
<p>
With this variable, it is possible to  display the number of cores that are
available in the CPU.
</p>
<dl class="org-dl">
<dt>Default value</dt><dd><code>"logical"</code></dd>
<dt>Values</dt><dd><ul class="org-ul">
<li><code>"logical"</code></li>
<li><code>"physical"</code></li>
<li><code>"off"</code></li>
</ul></dd>
<dt>Flag</dt><dd><code>"--cpu_cores"</code></dd>
<dt>Supports</dt><dd><code>physical</code> does not work on BSD.</dd>
<dt>Examples</dt><dd><dl class="org-dl">
<dt>logical</dt><dd><code>Intel i7-6500U (4) @ 3.1GHz</code> (All virtual cores)</dd>
<dt>physical</dt><dd><code>Intel i7-6500U (2) @ 3.1GHz</code> (All physical cores)</dd>
<dt>off</dt><dd><code>Intel i7-6500U @ 3.1GHz</code></dd>
</dl></dd>
</dl>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #DFDFDF;">cpu_cores</span>=<span style="color: #7bc275;">"off"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-h-66633b86-2427-4079-9e62-e72b3d458a21" class="outline-5">
<h5 id="h-66633b86-2427-4079-9e62-e72b3d458a21"><span class="section-number-5">3.2.1.6</span> CPU temperature</h5>
<div class="outline-text-5" id="text-h-66633b86-2427-4079-9e62-e72b3d458a21">
<p>
This variable allows the user to hide or show the CPU’s temperature, and if
shown, the user can display it in Celcius or Farenheit degrees. For FreeBSD
and  NetBSD-based systems,  you’ll  need to  enable  the <code>coretemp</code>  kernel
module. This only supports newer Intel processors.
</p>
<dl class="org-dl">
<dt>Default value</dt><dd><code>"off"</code></dd>
<dt>Values</dt><dd><ul class="org-ul">
<li><code>"C"</code></li>
<li><code>"F"</code></li>
<li><code>"off"</code></li>
</ul></dd>
<dt>Flag</dt><dd><code>"--cpu_temp"</code></dd>
<dt>Supports</dt><dd>Linux, BSD</dd>
<dt>Examples</dt><dd><dl class="org-dl">
<dt>C</dt><dd><code>Intel i7-6500U (4) @ 3.1GHz [27.2°C]</code></dd>
<dt>F</dt><dd><code>Intel i7-6500U (4) @ 3.1GHz [82.0°F]</code></dd>
<dt>off</dt><dd><code>Intel i7-6500U (4) @ 3.1GHz</code></dd>
</dl></dd>
</dl>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #DFDFDF;">cpu_temp</span>=<span style="color: #7bc275;">"off"</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-h-6138e3bd-937f-4604-b2c0-db0a49b869bc" class="outline-4">
<h4 id="h-6138e3bd-937f-4604-b2c0-db0a49b869bc"><span class="section-number-4">3.2.2</span> GPU</h4>
<div class="outline-text-4" id="text-h-6138e3bd-937f-4604-b2c0-db0a49b869bc">
<p>
The function  responsible for displaying  information regarding the  GPUs is
<code>gpu</code>. It  will try  to list all  available GPUs and  display what  it knows
about them.
</p>
</div>

<div id="outline-container-h-d2a0a4dd-7dc4-4584-8093-ce417b4bb59b" class="outline-5">
<h5 id="h-d2a0a4dd-7dc4-4584-8093-ce417b4bb59b"><span class="section-number-5">3.2.2.1</span> GPU brand</h5>
<div class="outline-text-5" id="text-h-d2a0a4dd-7dc4-4584-8093-ce417b4bb59b">
<p>
This value allows  the user to hide or  show the brand of their  GPU in the
output of <code>gpu</code>.
</p>
<dl class="org-dl">
<dt>Default value</dt><dd><code>"on"</code></dd>
<dt>Values</dt><dd><ul class="org-ul">
<li><code>"on"</code></li>
<li><code>"off"</code></li>
</ul></dd>
<dt>Flag</dt><dd><code>"--gpu_brand"</code></dd>
<dt>Supports</dt><dd></dd>

<dt>Examples</dt><dd><dl class="org-dl">
<dt>on</dt><dd><code>AMD HD 7950</code></dd>
<dt>off</dt><dd><code>HD 7950</code></dd>
</dl></dd>
</dl>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #DFDFDF;">gpu_brand</span>=<span style="color: #7bc275;">"off"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-h-4309d902-fc80-48c9-be89-02b932d1f650" class="outline-5">
<h5 id="h-4309d902-fc80-48c9-be89-02b932d1f650"><span class="section-number-5">3.2.2.2</span> Which GPU to display</h5>
<div class="outline-text-5" id="text-h-4309d902-fc80-48c9-be89-02b932d1f650">
<p>
This allows  the user  to choose  which GPU  appears in  the output  of the
function <code>gpu</code>.
</p>
<dl class="org-dl">
<dt>Default value</dt><dd><code>"all"</code></dd>
<dt>Values</dt><dd><ul class="org-ul">
<li><code>"all"</code></li>
<li><code>"dedicated"</code></li>
<li><code>"integrated"</code></li>
</ul></dd>
<dt>Flag</dt><dd><code>"--gpu_type"</code></dd>
<dt>Supports</dt><dd>Linux</dd>
<dt>Examples</dt><dd><dl class="org-dl">
<dt>all</dt><dd></dd>

<dt>dedicated</dt><dd><code>GPU1: AMD HD 7950</code></dd>
<dt>integrated</dt><dd><code>GPU1: Intel Integrated Graphics</code></dd>
</dl></dd>
</dl>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #DFDFDF;">gpu_type</span>=<span style="color: #7bc275;">"all"</span>
</pre>
</div>
</div>
</div>
</div>
